webapp-osgeo-live/src/main/webapp/static/examples/foss4g/requests_soap/DescribeSensor.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
	<env:Body>
		<swes:DescribeSensor service="SOS" version="2.0.0" xmlns:swes="http://www.opengis.net/swes/2.0"
			xmlns:gml="http://www.opengis.net/gml/3.2" xmlns:swe="http://www.opengis.net/swe/2.0"
			xsi:schemaLocation="http://www.opengis.net/swes/2.0 http://schemas.opengis.net/swes/2.0/swes.xsd http://www.opengis.net/swe/2.0 http://schemas.opengis.net/sweCommon/2.0/swe.xsd">
			<swes:procedure>http://id.eaufrance.fr/met/403.xml</swes:procedure>
			<swes:procedureDescriptionFormat>http://inspire.ec.europa.eu/featureconcept/Process</swes:procedureDescriptionFormat>
		</swes:DescribeSensor>
	</env:Body>
</env:Envelope>
