52n-sos-webapp/src/main/webapp/examples/sos_v20/requests_soap/GetObs/GetObs_TI_Equals.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope">
	<env:Body>
		<sos:GetObservation xmlns:sos="http://www.opengis.net/sos/2.0"
			service="SOS" version="2.0.0"
			xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2"
			xmlns:swe="http://www.opengis.net/swe/2.0" xmlns:swes="http://www.opengis.net/swes/2.0"
			xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/sos/2.0
http://schemas.opengis.net/sos/2.0.0/sos.xsd">
			<sos:temporalFilter>
				<fes:TEquals>
					<fes:ValueReference>phenomenonTime</fes:ValueReference>
					<gml:TimeInstant gml:id="ti_1">
						<gml:timePosition>2008-04-01T17:45:00+02:00</gml:timePosition>
					</gml:TimeInstant>
				</fes:TEquals>
			</sos:temporalFilter>
		</sos:GetObservation>
	</env:Body>
</env:Envelope>