52n-sos-webapp/src/main/webapp/examples/sos_v20/requests_soap/GetFoi/GetFeatureOfInterest_allParams.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope">
	<env:Body>
		<sos:GetFeatureOfInterest
			service="SOS" version="2.0.0" xmlns:sos="http://www.opengis.net/sos/2.0"
			xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2"
			xmlns:swe="http://www.opengis.net/swe/2.0" xmlns:swes="http://www.opengis.net/swes/2.0"
			xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/sos/2.0
http://schemas.opengis.net/sos/2.0.0/sos.xsd">
			<sos:procedure>urn:ogc:object:feature:Sensor:IFGI:ifgi-sensor-1
			</sos:procedure>
			<sos:observedProperty>urn:ogc:def:phenomenon:OGC:1.0.30:waterlevel
			</sos:observedProperty>
			<sos:featureOfInterest>foi_1001</sos:featureOfInterest>
			<sos:spatialFilter>
				<fes:BBOX>
					<fes:ValueReference>sams:shape</fes:ValueReference>
					<gml:Envelope srsName="http://www.opengis.net/def/crs/EPSG/0/4326">
						<gml:lowerCorner>0 0</gml:lowerCorner>
						<gml:upperCorner>60 60</gml:upperCorner>
					</gml:Envelope>
				</fes:BBOX>
			</sos:spatialFilter>
		</sos:GetFeatureOfInterest>
	</env:Body>
</env:Envelope>